# 2014 - 2017 Shooting Data Analysis

Data Source: http://www.gunviolencearchive.org/

In [34]:
import pandas as pd

In [35]:
df14 = pd.read_csv("Data/2014.csv")
df15 = pd.read_csv("Data/2015.csv")
df16 = pd.read_csv("Data/2016.csv")
df17 = pd.read_csv("Data/2017.csv")
df14.head()

,Incident Date,State,City Or County,Address,# Killed,# Injured,Operations
0,12/31/14,California,Los Angeles,81st Street and Western Avenue,1,3,NaN
1,12/29/14,Louisiana,New Orleans,Poydras and Bolivar,0,4,NaN
2,12/27/14,California,Los Angeles,8800 block of South Figueroa Street,1,3,NaN
3,12/27/14,California,Sacramento,4000 block of May Street,0,4,NaN
4,12/26/14,Illinois,East St. Louis,2500 block of Summit Avenue,1,3,NaN

In [36]:
frames = [df14, df15, df16, df17]

In [37]:
df = pd.concat(frames).fillna(0)
df.head()

,Incident Date,State,City Or County,Address,# Killed,# Injured,Operations
0,12/31/14,California,Los Angeles,81st Street and Western Avenue,1,3,0.0
1,12/29/14,Louisiana,New Orleans,Poydras and Bolivar,0,4,0.0
2,12/27/14,California,Los Angeles,8800 block of South Figueroa Street,1,3,0.0
3,12/27/14,California,Sacramento,4000 block of May Street,0,4,0.0
4,12/26/14,Illinois,East St. Louis,2500 block of Summit Avenue,1,3,0.0

In [38]:
df['Date'] = pd.to_datetime(df['Incident Date'], format="%m/%d/%y")
df.head()

,Incident Date,State,City Or County,Address,# Killed,# Injured,Operations,Date
0,12/31/14,California,Los Angeles,81st Street and Western Avenue,1,3,0.0,2014-12-31
1,12/29/14,Louisiana,New Orleans,Poydras and Bolivar,0,4,0.0,2014-12-29
2,12/27/14,California,Los Angeles,8800 block of South Figueroa Street,1,3,0.0,2014-12-27
3,12/27/14,California,Sacramento,4000 block of May Street,0,4,0.0,2014-12-27
4,12/26/14,Illinois,East St. Louis,2500 block of Summit Avenue,1,3,0.0,2014-12-26

In [39]:
df2 = df['Date'].value_counts()
df2.head()

2017-04-15    6
2017-04-29    6
2016-07-04    6
2014-07-05    6
2016-09-11    6
Name: Date, dtype: int64

In [40]:
df2.to_csv('Data/14-17Data.csv')

# Read in the new data file again

In [41]:
dff = pd.read_csv("Data/14-17Data.csv", names = ['Dates', 'Counts'])
dff.head()

        Dates  Counts
0  2017-04-15       6
1  2017-04-29       6
2  2016-07-04       6
3  2014-07-05       6
4  2016-09-11       6

In [42]:
dff['Date'] = pd.to_datetime(dff['Dates'], format="%Y-%m-%d")
dff.head()

        Dates  Counts       Date
0  2017-04-15       6 2017-04-15
1  2017-04-29       6 2017-04-29
2  2016-07-04       6 2016-07-04
3  2014-07-05       6 2014-07-05
4  2016-09-11       6 2016-09-11

In [43]:
dfDate= pd.read_csv("Data/14-17Date.csv")
dfDate.head()

    Dates
0  1/1/14
1  1/2/14
2  1/3/14
3  1/4/14
4  1/5/14

In [44]:
dfDate['Date'] = pd.to_datetime(dfDate['Dates'], format="%m/%d/%y")
dfDate.head()

    Dates       Date
0  1/1/14 2014-01-01
1  1/2/14 2014-01-02
2  1/3/14 2014-01-03
3  1/4/14 2014-01-04
4  1/5/14 2014-01-05

In [45]:
dff.dtypes

Dates             object
Counts             int64
Date      datetime64[ns]
dtype: object

In [46]:
dfDate.dtypes

Dates            object
Date     datetime64[ns]
dtype: object

In [47]:
dfFinal = pd.merge(dfDate, dff, on='Date', how='outer')
dfFinal.head()

  Dates_x       Date     Dates_y  Counts
0  1/1/14 2014-01-01  2014-01-01     1.0
1  1/2/14 2014-01-02         NaN     NaN
2  1/3/14 2014-01-03  2014-01-03     1.0
3  1/4/14 2014-01-04         NaN     NaN
4  1/5/14 2014-01-05         NaN     NaN

In [48]:
dfFinal = dfFinal.fillna(0)
dfFinal.head()

  Dates_x       Date     Dates_y  Counts
0  1/1/14 2014-01-01  2014-01-01     1.0
1  1/2/14 2014-01-02           0     0.0
2  1/3/14 2014-01-03  2014-01-03     1.0
3  1/4/14 2014-01-04           0     0.0
4  1/5/14 2014-01-05           0     0.0

In [49]:
dfFinal.to_csv('Data/14-17finalData.csv')

# How many shootings per year?

In [50]:
dff['year'] = dff['Date'].dt.year
dff.head()

        Dates  Counts       Date  year
0  2017-04-15       6 2017-04-15  2017
1  2017-04-29       6 2017-04-29  2017
2  2016-07-04       6 2016-07-04  2016
3  2014-07-05       6 2014-07-05  2014
4  2016-09-11       6 2016-09-11  2016

In [51]:
dfYear = dff.groupby('year')['Counts'].sum()
dfYear

year
2014    273
2015    333
2016    383
2017    328
Name: Counts, dtype: int64

In [52]:
dfYear.to_csv('Data/yearData.csv')